<a href="https://colab.research.google.com/github/abha989/sql-for-data-analysis/blob/main/SQL_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#SQL BASICS ASSIGNMENT QUESTION

In [ ]:
'''1. Create a table called employees with the following structure?
: emp_id (integer, should not be NULL and should be a primary key)Q
: emp_name (text, should not be NULL)Q
: age (integer, should have a check constraint to ensure the age is at least 18)Q
: email (text, should be unique for each employee)Q
: salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.'''

In [ ]:
'''CREATE TABLE employee (
    emp_id INTEGER,
    emp_name VARCHAR(100) NOT NULL,
    age INTEGER CHECK (age >= 18),
    email VARCHAR(255) UNIQUE,
    salary DECIMAL DEFAULT 30000
);'''

In [ ]:
'''2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints'''

In [ ]:
'''Constraints are rules applied to database tables to ensure the accuracy, consistency, and integrity of the data. They restrict the types of data that can be inserted, updated, or deleted in a table, preventing invalid or inconsistent data from being stored.
The main purposes of constraints are:
Data Integrity: Ensure the data entered into a database is accurate and reliable.
Prevent Errors: Avoid mistakes caused by human input or faulty applications.
Maintain Relationships: Enforce relationships between tables using keys and referential integrity.
Optimize Performance: Improve query performance by eliminating unnecessary data checks.

Common Types of Constraints
Here are some of the most commonly used database constraints:
1-Primary Key Constraint
2-Foreign Key Constraint
3-Unique Constraint
4-Check Constraint
5-Not Null Constraint
6-Default Constraint '''

In [ ]:
'''3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.'''

In [ ]:
''' The NOT NULL constraint is applied to a column to ensure that it cannot store NULL values.
This is particularly useful when a column's data is essential for the integrity or functionality of the
 application.
 No, a Primary Key cannot contain NULL values.
Justification:
1- Uniqueness and Identification
2-Database Integrity
3-Indexing

In [ ]:
'''4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.'''

In [ ]:
''' you can use the ALTER TABLE statement to add or remove constraints from an existing table.
The process may vary depending on the type of constraint.

Adding constraint

ALTER TABLE employee
MODIFY COLUMN Age int NOT NULL;

Removing constraint

ALTER TABLE Employees
DROP CONSTRAINT CHK_Age;

In [ ]:
'''5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.'''

In [ ]:
'''When attempting to insert, update, or delete data that violates constraints in MySQL,
the database management system (DBMS) will prevent the action and return an error. Constraints are
enforced to maintain data integrity and ensure that the database remains consistent.
Here are the typical consequences of violating different types of constraints:

insert into employee Values (101, "Abha","ayadav989@gmail.com",50000);

Consequence: You cannot insert duplicate values or NULL in a primary key column.
ERROR 1062 (23000): Duplicate entry '101' for key 'PRIMARY'''

In [ ]:
'''6- You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00'''

In [ ]:
''' Alter Table Products
add Primary Key(product_id );'''

'''ALTER TABLE Products
MODIFY COLUMN price INT DEFAULT 50.0;'''

In [ ]:
'''7. You have two tables:
Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

In [ ]:
'''SELECT Students.student_name, Classes.class_name
FROM Students
INNER JOIN Classes ON Students.class_id = Classes.class_id;'''

In [ ]:
'''8. Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
listed even if they are not associated with an order
Hint: (use INNER JOIN and LEFT JOIN)5

In [ ]:
'''SELECT
    o.order_id,
    c.customer_name,
    p.product_name
FROM products p
LEFT JOIN order_details od ON p.product_id = od.product_id
LEFT JOIN orders o ON od.order_id = o.order_id
LEFT JOIN customers c ON o.customer_id = c.customer_id;
'''

In [ ]:
#9-Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

In [ ]:
''' SELECT
    p.product_name,
    SUM(od.quantity * od.unit_price) AS total_sales
FROM order_details od
INNER JOIN products p ON od.product_id = p.product_id
GROUP BY p.product_name
ORDER BY total_sales DESC;
'''

In [ ]:
#10- Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.

In [ ]:
''' SELECT
    o.order_id,
    c.customer_name,
    SUM(od.quantity) AS total_quantity
FROM orders o
INNER JOIN customers c ON o.customer_id = c.customer_id
INNER JOIN order_details od ON o.order_id = od.order_id
GROUP BY o.order_id, c.customer_name
ORDER BY c.customer_name, o.order_id;
'''

In [ ]:
# SQL COMMANDS

In [ ]:
#1-Identify the primary keys and foreign keys in maven movies db. Discuss the differences

In [ ]:
''' SELECT  actor,  actor_id
FROM INFORMATION_SCHEMA.KEY_COLUMN_USAGE
WHERE TABLE_SCHEMA = 'mavenmovies'
AND CONSTRAINT_NAME = 'PRIMARY';

          Primary Key                                                       	Foreign Key
Uniquely identifies each row in a table.	                  Establishes a relationship between tables.
Cannot contain NULL values.	                                Can contain NULL if the relationship allows it.
Only one primary key is allowed per table.	                Multiple foreign keys can exist in a table.
Automatically enforces uniqueness.	                        Does not enforce uniqueness in the child table.
Typically used for table identification.	                  Used for maintaining referential integrity.

In [ ]:
#2-List all details of actors'''

In [ ]:
'''Select * from actor;'''

In [ ]:
#3-List all customer information from DB.'''

In [ ]:
'''Select * from actor;'''

In [ ]:
#4- List different countries.'''

In [ ]:
''' Select Country From Country;'''

In [ ]:
#5- Display all active customers.'''

In [ ]:
''' select first_name, last_name from customer where active = 1;'''

In [ ]:
#6- -List of all rental IDs for customer with ID 1.'''

In [ ]:
''' select rental_id from rental where customer_id =1;'''

In [ ]:
#7- Display all the films whose rental duration is greater than 5 .'''

In [ ]:
''' select film_id, title from film where rental_duration >5;'''

In [ ]:
#8- List the total number of films whose replacement cost is greater than $15 and less than $20.'''

In [ ]:
'''select film_id, title from film where replacement_cost > 15 and replacement_cost < 20;'''

In [ ]:
#9 - Display the count of unique first names of actors.'''

In [ ]:
''' Select count(distinct first_name) from actor;'''

In [ ]:
#10 - Display the first 10 records from the customer table'''

In [ ]:
'''select * from customer limit 10;'''

In [ ]:
#11- Display the first 3 records from the customer table whose first name starts with ‘b’.'''

In [ ]:
'''select * from customer where first_name like 'b%' limit 3;'''

In [ ]:
#12- Display the names of the first 5 movies which are rated as ‘G’.'''

In [ ]:
''' select  film_id, title from film  where rating = 'G'  limit 5;'''

In [ ]:
#13- Find all customers whose first name starts with "a".'''

In [ ]:
''' select first_name, last_name from customer where first_name like 'a%';'''

In [ ]:
#14- Find all customers whose first name ends with "a".

In [ ]:
''' select first_name, last_name from customer where first_name like '%a';'''

In [ ]:
#15- Display the list of first 4 cities which start and end with ‘a’ .

In [ ]:
''' select first_name, last_name from customer where first_name like '%a' and first_name like 'a%';'''

In [ ]:
#16-  Find all customers whose first name have "NI" in any position.'''

In [ ]:
''' select first_name from customer where first_name like '%ni%';'''

In [ ]:
#17- Find all customers whose first name have "r" in the second position .'''

In [ ]:
''' select first_name from customer where first_name like '_r%';'''

In [ ]:
#18- Find all customers whose first name starts with "a" and are at least 5 characters in length.'''

In [ ]:
''' select first_name from customer where first_name like '%a_____';'''

In [ ]:
#19- Find all customers whose first name starts with "a" and ends with "o".'''

In [ ]:
'''select first_name from customer where first_name like 'a%' and first_name like '%o';'''

In [ ]:
#20- Get the films with pg and pg-13 rating using IN operator.'''

In [ ]:
''' select * from film where rating in('pg','pg-13');'''

In [ ]:
#21- Get the films with length between 50 to 100 using between operator'''

In [ ]:
'''select * from film where length between 5 and 100;'''

In [ ]:
#22- Get the top 50 actors using limit operator.'''

In [ ]:
''' select * from actor limit 50;'''

In [ ]:
#23-- Get the distinct film ids from inventory table.'''

In [ ]:
'''select distinct film_id from inventory;'''

In [ ]:
## Functions
#. Basic Aggregate Functions:

In [ ]:
#1- Retrieve the total number of rentals made in the Sakila database.Hint: Use the COUNT() function.

In [ ]:
''' select Count(rental_id) from rental;'''

In [ ]:
#2- Find the average rental duration (in days) of movies rented from the Sakila database.Hint: Utilize the AVG() function.

In [ ]:
''' select avg(rental_duration) from film; '''

In [ ]:
#3- Display the first name and last name of customers in uppercase.Hint: Use the UPPER () function.

In [ ]:
''' select upper(concat(first_name,last_name)) as name from customer;'''

In [ ]:
#4- Extract the month from the rental date and display it alongside the rental ID.Hint: Employ the MONTH() function.

In [ ]:
''' select rental_id, extract(month from rental_date) from rental;'''

In [ ]:
#5- Retrieve the count of rentals for each customer (display customer ID and the count of rentals).Hint: Use COUNT () in conjunction with GROUP BY.

In [ ]:
''' select count(rental_id), customer_id from rental group by customer_id;'''

In [ ]:
#6- Find the total revenue generated by each store.Hint: Combine SUM() and GROUP BY.

In [ ]:
''' SELECT s.store_id, SUM(p.amount) AS total_revenue
FROM payment p
JOIN staff s ON p.staff_id = s.staff_id
GROUP BY s.store_id;'''

In [ ]:
#7- Determine the total number of rentals for each category of movies.Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.

In [ ]:
'''SELECT c.name AS category_name, COUNT(r.rental_id) AS total_rentals
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name
ORDER BY total_rentals DESC;
'''

In [ ]:
#8- Find the average rental rate of movies in each language.Hint: JOIN film and language tables, then use AVG () and GROUP BY.

In [ ]:
'''SELECT l.name AS language_name, AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name
ORDER BY average_rental_rate DESC;
'''

In [ ]:
# Joins

In [ ]:
#9- Display the title of the movie, customer s first name, and last name who rented it.Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
''' SELECT
    f.title AS movie_title,
    c.first_name,
    c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;
'''

In [ ]:
#10- Retrieve the names of all actors who have appeared in the film "Gone with the Wind."Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
'''SELECT
    a.first_name,
    a.last_name
FROM film f
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor a ON fa.actor_id = a.actor_id
WHERE f.title = 'Gone with the Wind';
'''

In [ ]:
#11- Retrieve the customer names along with the total amount they've spent on rentals.Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
''' SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_amount_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_amount_spent DESC;
'''

In [ ]:
#12- List the titles of movies rented by each customer in a particular city (e.g., 'London').Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
'''SELECT
    c.first_name,
    c.last_name,
    ci.city,
    f.title AS movie_title
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
ORDER BY c.last_name, c.first_name, f.title;
'''

In [ ]:
#13- Display the top 5 rented movies along with the number of times they've been rented.JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

In [ ]:
''' SELECT
    f.title AS movie_title,
    COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.film_id, f.title
ORDER BY rental_count DESC
LIMIT 5;
'''

In [ ]:
#14- Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

In [ ]:
'''SELECT
    c.first_name,
    c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN customer c ON r.customer_id = c.customer_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT i.store_id) = 2;
'''

In [ ]:
#Windows Function:

In [ ]:
#1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
''' WITH CustomerSpending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT
    customer_id,
    first_name,
    last_name,
    total_spent,
    RANK() OVER (ORDER BY total_spent DESC) AS spending_rank
FROM CustomerSpending
ORDER BY spending_rank;
'''

In [ ]:
#2.Calculate the cumulative revenue generated by each film over time.

In [ ]:
'''WITH FilmRevenue AS (
    SELECT
        f.film_id,
        f.title,
        r.rental_date,
        p.amount
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    JOIN payment p ON r.rental_id = p.rental_id
)
SELECT
    film_id,
    title,
    rental_date,
    amount,
    SUM(amount) OVER (PARTITION BY film_id ORDER BY rental_date) AS cumulative_revenue
FROM FilmRevenue
ORDER BY film_id, rental_date;
'''

In [ ]:
#3- Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
''' WITH RentalDuration AS (
    SELECT
        f.film_id,
        f.title,
        f.length,  -- Length of the film (in minutes)
        DATEDIFF(r.return_date, r.rental_date) AS rental_duration
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    WHERE r.return_date IS NOT NULL  -- Ensures that rentals have been returned
)
SELECT
    length,
    AVG(rental_duration) AS avg_rental_duration
FROM RentalDuration
GROUP BY length
ORDER BY length;
'''

In [ ]:
#4-Identify the top 3 films in each category based on their rental counts.

In [ ]:
'''WITH FilmRentalCounts AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title, c.name
)
SELECT
    film_id,
    title,
    category_name,
    rental_count,
    ROW_NUMBER() OVER (PARTITION BY category_name ORDER BY rental_count DESC) AS rank
FROM FilmRentalCounts
WHERE rank <= 3
ORDER BY category_name, rank;
'''

In [ ]:
#5-Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

In [ ]:
'''WITH CustomerRentals AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        COUNT(r.rental_id) AS total_rentals
    FROM customer c
    LEFT JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
AverageRentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM CustomerRentals
)
SELECT
    cr.customer_id,
    cr.first_name,
    cr.last_name,
    cr.total_rentals,
    ar.avg_rentals,
    (cr.total_rentals - ar.avg_rentals) AS rental_difference
FROM CustomerRentals cr, AverageRentals ar
ORDER BY rental_difference DESC;
'''

In [ ]:
#6-Find the monthly revenue trend for the entire rental store over time.

In [ ]:
'''SELECT
    DATE_FORMAT(r.rental_date, '%Y-%m') AS month,
    SUM(p.amount) AS total_revenue
FROM rental r
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY month
ORDER BY month;
'''

In [ ]:
#7-  Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
'''WITH TotalSpending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spending
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
SpendingPercentile AS (
    SELECT
        PERCENTILE_CONT(0.80) WITHIN GROUP (ORDER BY total_spending DESC) AS top_20_percent_threshold
    FROM TotalSpending
)
SELECT
    ts.customer_id,
    ts.first_name,
    ts.last_name,
    ts.total_spending
FROM TotalSpending ts, SpendingPercentile sp
WHERE ts.total_spending >= sp.top_20_percent_threshold
ORDER BY ts.total_spending DESC;
'''

In [ ]:
#8-Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
'''WITH CategoryRentalCount AS (
    SELECT
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film_category fc ON i.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY c.name
),
RunningTotal AS (
    SELECT
        category_name,
        rental_count,
        SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total
    FROM CategoryRentalCount
)
SELECT
    category_name,
    rental_count,
    running_total
FROM RunningTotal
ORDER BY rental_count DESC;
'''

In [ ]:
#9-Find the films that have been rented less than the average rental count for their respective categories

In [ ]:
'''WITH FilmRentalCount AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film_category fc ON i.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN film f ON f.film_id = i.film_id
    GROUP BY f.film_id, f.title, c.name
),
CategoryAvgRentalCount AS (
    SELECT
        c.name AS category_name,
        AVG(COUNT(r.rental_id)) OVER (PARTITION BY c.name) AS avg_rental_count
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film_category fc ON i.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    GROUP BY c.name
)
SELECT
    frc.film_id,
    frc.title,
    frc.category_name,
    frc.rental_count,
    car.avg_rental_count
FROM FilmRentalCount frc
JOIN CategoryAvgRentalCount car ON frc.category_name = car.category_name
WHERE frc.rental_count < car.avg_rental_count
ORDER BY frc.category_name, frc.rental_count;
'''

In [ ]:
#10- Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
''' WITH MonthlyRevenue AS (
    SELECT
        DATE_FORMAT(r.rental_date, '%Y-%m') AS month_year,
        SUM(p.amount) AS total_revenue
    FROM payment p
    JOIN rental r ON p.rental_id = r.rental_id
    GROUP BY month_year
)
SELECT
    month_year,
    total_revenue
FROM MonthlyRevenue
ORDER BY total_revenue DESC
LIMIT 5;
'''

In [ ]:
#Normalisation & CTE

In [ ]:
'''1. First Normal Form (1NF):
a. Identify a table in the Sakila database that violates 1NF. Explain how you
would normalize it to achieve 1NF.'''

In [ ]:
''' CREATE TABLE film_text (
  film_id SMALLINT NOT NULL,
  title VARCHAR(255) NOT NULL,
  description TEXT,
  PRIMARY KEY (film_id)
);
The description column often contains multiple pieces of information (e.g., genre, plot details, actors, etc.) stored as a single text field.

Storing multiple values in one column violates 1NF since it’s not atomic.

 Steps to Normalize the Table to 1NF
To achieve 1NF, follow these steps:

1. Split the Data into Separate Tables
Create separate tables for distinct types of information.

Remove the non-atomic description field and store the details in relevant tables like film_category, film_actor, or film_description.

2. Ensuring Atomic Data
Each column now contains a single value instead of combined information.

Queries can be performed efficiently using JOIN operations.

In [ ]:
'''2. Second Normal Form (2NF):
a. Choose a table in Sakila and describe how you would determine whether it is in 2NF.
If it violates 2NF, explain the steps to normalize it.'''

In [ ]:
''' Second Normal Form (2NF) builds on First Normal Form (1NF) and requires that:

The table must be in 1NF (no repeating groups, atomic data).

No partial dependency should exist. This means no non-prime attribute (a column that is not part of a primary key) should depend only on a part of a composite primary key.
Step 1: Check for 2NF Compliance
The table is in 1NF since all data is atomic, and there are no repeating groups.

However, to satisfy 2NF, we must ensure that all non-key attributes are fully dependent on the entire primary key, not just a part of it.

Analysis:
The last_update column is not dependent on both actor_id and film_id.

It is just a general timestamp, not specifically related to the relationship between an actor and a film.

This means the table violates 2NF.
Step 2: Normalize to 2NF
Solution:
Remove the last_update column from the film_actor table.

Create a separate table to store timestamps and general film updates.'''

In [ ]:
'''3. Third Normal Form (3NF):

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies

 present and outline the steps to normalize the table to 3NF.'''

In [ ]:
'''Understanding Third Normal Form (3NF)
Third Normal Form (3NF) is achieved when:

The table is in Second Normal Form (2NF).

There are no transitive dependencies.

Transitive Dependency means:
A non-prime attribute (not part of the primary key) depends on another non-prime attribute instead of depending directly on the primary key.
CREATE TABLE customer (
  customer_id SMALLINT NOT NULL,
  store_id TINYINT NOT NULL,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  email VARCHAR(50),
  address_id SMALLINT NOT NULL,
  active BOOLEAN NOT NULL,
  create_date DATETIME NOT NULL,
  last_update TIMESTAMP,
  PRIMARY KEY (customer_id)
);
Transitive Dependency
The table has an address_id column, which references the address of the customer.

The address contains city_id, and further, city_id refers to the city in the city table, which also contains country_id to identify the country.

Therefore, the customer’s city and country are indirectly determined through the address.

This creates a transitive dependency:
Steps to Normalize the Table to 3NF
Step 1: Remove Transitive Dependencies
Create separate tables for Address, City, and Country instead of storing redundant data.

Link the customer table to the Address table using address_id.'''

In [ ]:
'''4. Normalization Process:

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial

 unnormalized form up to at least 2NF.'''

In [ ]:
'''Normalization Process: From Unnormalized Form to 2NF
Let's go through the normalization process step by step using a specific example from the Sakila database.

Step 1: Choose a Table to Normalize
We'll work with a hypothetical Unnormalized Table (UNF) that combines data from multiple tables for easy understanding.
Issues in UNF:
Repeating Groups: John Doe is listed multiple times for different rentals.

Redundant Data: Film titles and categories are duplicated.

No Primary Key: There’s no clear unique identifier for each record.

Step 2: Convert to First Normal Form (1NF)
1NF Rules:
Ensure each column contains atomic (indivisible) values.

Remove repeating groups.

Identify a Primary Key.

Convert to 1NF:
Each value is now atomic (e.g., separate columns for customer and film details).

Rental_ID is assigned as the Primary Key.
 Step 3: Convert to Second Normal Form (2NF)
2NF Rules:
Ensure it is in 1NF.

Remove Partial Dependencies.

Every non-key column should depend on the whole primary key.

Issue in 1NF:
Customer_Name depends only on the Rental_ID but not on the Film data.

Film_Category depends on the Film_Title, not directly on the Rental_ID.

Solution:
Create three tables to remove partial dependencies.

In [ ]:
'''5-CTE Basics:

 a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they

 have acted in from the actor and film_actor tables'''

In [ ]:
'''WITH ActorFilmCount AS (
    SELECT
        a.first_name,
        a.last_name,
        COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT
    first_name,
    last_name,
    film_count
FROM ActorFilmCount;
'''

In [ ]:
'''6- CTE with Joins:

 a. Create a CTE that combines information from the film and language tables to display the film title,

 language name, and rental rate.'''

In [ ]:
'''WITH FilmLanguage AS (
    SELECT
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM FilmLanguage;
'''

In [ ]:
'''7-CTE for Aggregation:

 a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments)

 from the customer and payment tables.'''

In [ ]:
'''WITH CustomerRevenue AS (
    SELECT
        p.customer_id,
        SUM(p.amount) AS total_revenue
    FROM payment p
    GROUP BY p.customer_id
)
SELECT
    c.first_name,
    c.last_name,
    cr.total_revenue
FROM CustomerRevenue cr
JOIN customer c ON cr.customer_id = c.customer_id
ORDER BY cr.total_revenue DESC;
'''

In [ ]:
'''8-  CTE with Window Functions:

 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.'''

In [ ]:
'''WITH RankedFilms AS (
    SELECT
        f.film_id,
        f.title,
        f.rental_duration,
        RANK() OVER (ORDER BY f.rental_duration DESC) AS rental_rank
    FROM film f
)
SELECT
    film_id,
    title,
    rental_duration,
    rental_rank
FROM RankedFilms
ORDER BY rental_rank;
'''

In [ ]:
'''9- CTE and Filtering:

 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the

 customer table to retrieve additional customer details.'''

In [ ]:
'''WITH CustomerRentalCount AS (
    SELECT
        r.customer_id,
        COUNT(r.rental_id) AS rental_count
    FROM rental r
    GROUP BY r.customer_id
    HAVING COUNT(r.rental_id) > 2
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    crc.rental_count
FROM CustomerRentalCount crc
JOIN customer c ON crc.customer_id = c.customer_id;
'''

In [ ]:
'''10-a. Write a query using a CTE to find the total number of rentals made each month, considering the

 rental_date from the rental table
'''

In [ ]:
'''WITH MonthlyRentals AS (
    SELECT
        YEAR(r.rental_date) AS rental_year,
        MONTH(r.rental_date) AS rental_month,
        COUNT(r.rental_id) AS total_rentals
    FROM rental r
    GROUP BY YEAR(r.rental_date), MONTH(r.rental_date)
)
SELECT
    rental_year,
    rental_month,
    total_rentals
FROM MonthlyRentals
ORDER BY rental_year DESC, rental_month DESC;
'''

In [ ]:
'''11-CTE and Self-Join:

 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film

 together, using the film_actor table.'''

In [ ]:
'''WITH ActorPairs AS (
    SELECT
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id,
        fa1.film_id
    FROM film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE fa1.actor_id < fa2.actor_id  -- To avoid duplicate pairs
)
SELECT
    a1.first_name AS actor1_first_name,
    a1.last_name AS actor1_last_name,
    a2.first_name AS actor2_first_name,
    a2.last_name AS actor2_last_name,
    ap.film_id
FROM ActorPairs ap
JOIN actor a1 ON ap.actor1_id = a1.actor_id
JOIN actor a2 ON ap.actor2_id = a2.actor_id
ORDER BY ap.film_id;
'''

In [ ]:
'''CTE for Recursive Search:

 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager,

 considering the reports_to column'''

In [ ]:
'''WITH RECURSIVE EmployeeHierarchy AS (
    -- Base case: select the manager
    SELECT
        s.employee_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM staff s
    WHERE s.employee_id = <specific_manager_id>  -- Replace with the manager's ID (e.g., 1)

    UNION ALL

    -- Recursive case: find employees who report to the selected employees
    SELECT
        s.employee_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM staff s
    INNER JOIN EmployeeHierarchy eh ON s.reports_to = eh.employee_id
)
-- Final selection: retrieve the employees in the hierarchy
SELECT
    employee_id,
    first_name,
    last_name,
    reports_to
FROM EmployeeHierarchy
ORDER BY employee_id;
'''